["[Start of Prompt]\nYou are an expert molecular biologist who studies how genes and pathways are related using Perturb-seq.\n\nTask: You are writing a brief overview of a gene set observed to have a similar transcriptional response when upstream genes are perturbed.\n\nInput: You will be provided descriptions of the constituent genes. Ensure that your overview remains faithful to this domain knowledge.\n\nOutput format: Fill in each of these three sections.\n1) Brief overview of gene set: Write one to two sentences summarizing how the given genes are related. Focus on the most specific pathways that are common among these genes.\n2) Upstream pathways may affect this gene set: Write one to two sentences describing what types of perturbations might impact the expression of the genes in this gene set. For example, you might consider pathways that are upstream of these genes or compensatory mechanisms.\n3) Name of gene set: Summarize the gene set within ten words.\n\nConstraints:\n- Maintain a professional tone throughout.\n- Do not comment on your own writing.\n- Do not add any notes or references. Do not make up additional information.\n- Do not discuss the importance or impact of the gene set. Focus only on its function.\n[End of Prompt]\n\n[Start of Input]\n- The primary molecular and cellular function of gene MT-ND6 is to encode a core subunit of the mitochondrial membrane respiratory chain NADH dehydrogenase (Complex I), which catalyzes electron transfer from NADH through the respiratory chain using ubiquinone as an electron acceptor. This subunit is essential for the proper functioning of Complex I, enabling the catalysis of the reaction that generates energy for the cell.\n- The primary molecular and cellular function of gene MT-CO2 is to encode the Cytochrome c oxidase subunit 2, a component of the cytochrome c oxidase complex, which catalyzes the reduction of oxygen to water in the mitochondrial electron transport chain, driving oxidative phosphorylation. This subunit plays a crucial role in the transfer of electrons from reduced cytochrome c to the active site of the enzyme, ultimately resulting in the generation of an electrochemical gradient across the inner mitochondrial membrane.\n- The primary molecular and cellular function of gene MT-CYB is to encode the cytochrome b protein, a component of the ubiquinol-cytochrome c reductase complex (complex III or cytochrome b-c1 complex), which mediates electron transfer from ubiquinol to cytochrome c and contributes to the generation of a proton gradient across the mitochondrial membrane for ATP synthesis. This complex is a crucial part of the mitochondrial respiratory chain.\n- The primary molecular and cellular function of gene MT-ND2 is to encode a core subunit of the mitochondrial membrane respiratory chain NADH dehydrogenase (Complex I), which catalyzes electron transfer from NADH through the respiratory chain using ubiquinone as an electron acceptor. This function enables the gene product to participate in the biological process of NADH dehydrogenase (ubiquinone) activity, facilitating the reaction that generates energy for the cell.\n- The primary molecular and cellular function of gene MT-ND5 is to encode a core subunit of the mitochondrial membrane respiratory chain NADH dehydrogenase (Complex I), which catalyzes electron transfer from NADH through the respiratory chain using ubiquinone as an electron acceptor. This subunit is essential for the proper functioning of Complex I, enabling the catalysis of the reaction that generates energy for the cell.\n- The primary molecular and cellular function of gene MT-CO1 is to encode the Cytochrome c oxidase subunit 1, a component of the cytochrome c oxidase complex, which catalyzes the reduction of oxygen to water in the mitochondrial electron transport chain, driving oxidative phosphorylation. This complex is essential for generating energy in the form of ATP for the cell.\n- The primary molecular and cellular function of gene MT-ND3 is to encode a core subunit of the mitochondrial NADH:ubiquinone oxidoreductase complex, which catalyzes the transfer of electrons from NADH to ubiquinone, thereby generating a proton gradient across the inner mitochondrial membrane. This process is essential for the generation of ATP during oxidative phosphorylation.\n- The primary molecular and cellular function of gene MT-ND4 is to encode a core subunit of the mitochondrial membrane respiratory chain NADH dehydrogenase (Complex I), which catalyzes electron transfer from NADH through the respiratory chain using ubiquinone as an electron acceptor. This subunit is essential for the proper functioning of Complex I, enabling the catalysis of the reaction that generates energy for the cell.\n- The primary molecular and cellular function of gene MT-ND1 is to encode a core subunit of the mitochondrial membrane respiratory chain NADH dehydrogenase (Complex I), which catalyzes electron transfer from NADH through the respiratory chain using ubiquinone as an electron acceptor. This enables the catalysis of the reaction: NADH + ubiquinone + 5 H+(in) = NAD+ + ubiquinol + 4 H+(out).\n- The primary molecular and cellular function of gene MT-ATP6 is to encode a key component of the mitochondrial membrane ATP synthase, specifically the subunit a of the F(0) domain, which plays a direct role in the translocation of protons across the membrane, ultimately contributing to the production of ATP from ADP. This gene product is a crucial part of the proton channel, facilitating the coupling of ATP synthesis to proton translocation.\n- The primary molecular and cellular function of gene MT-CO3 is to encode the Cytochrome c oxidase subunit 3, a component of the cytochrome c oxidase complex, which catalyzes the reduction of oxygen to water in the mitochondrial electron transport chain, driving oxidative phosphorylation. This subunit is part of the catalytic core of the complex, facilitating the transfer of electrons from reduced cytochrome c to molecular oxygen.\n- The primary molecular and cellular function of gene MT-ND4L is to encode a core subunit of the mitochondrial NADH:ubiquinone oxidoreductase complex, which catalyzes the transfer of electrons from NADH to ubiquinone, thereby generating a proton gradient across the inner mitochondrial membrane. This process is essential for the generation of ATP during oxidative phosphorylation.\n- The primary molecular and cellular function of gene MT-ATP8 is to encode a minor subunit of the mitochondrial membrane ATP synthase, specifically part of the F(0) domain, which generates ATP from ADP in the presence of a proton gradient across the membrane. This subunit is involved in the proton translocation process, contributing to the overall ATP synthesis mechanism.\n- The primary molecular and cellular function of gene MTRNR2L8 is to encode a non-coding RNA that acts as a receptor antagonist, thereby decreasing the ability of receptor agonists to bind and activate their respective receptors. This function is likely involved in modulating various cellular signaling pathways.\n- The primary molecular and cellular function of gene MTRNR2L12 is to encode a non-coding RNA that acts as a receptor antagonist, thereby decreasing the ability of receptor agonists to bind and activate their respective receptors. This function is likely involved in modulating various cellular signaling pathways.\n[End of Input]\n\n[Start of Output]\n1) Brief overview of gene set:\n2) Upstream pathways may affect this gene set:\n3) Name of gene set:\n[End of Output]\n", "[Start of Prompt]\nYou are an expert molecular biologist who studies how genes and pathways are related using Perturb-seq.\n\nTask: You are writing a brief overview of a gene set observed to have a similar transcriptional response when upstream genes are perturbed.\n\nInput: You will be provided descriptions of the constituent genes. Ensure that your overview remains faithful to this domain knowledge.\n\nOutput format: Fill in each of these three sections.\n1) Brief overview of gene set: Write one to two sentences summarizing how the given genes are related. Focus on the most specific pathways that are common among these genes.\n2) Upstream pathways may affect this gene set: Write one to two sentences describing what types of perturbations might impact the expression of the genes in this gene set. For example, you might consider pathways that are upstream of these genes or compensatory mechanisms.\n3) Name of gene set: Summarize the gene set within ten words.\n\nConstraints:\n- Maintain a professional tone throughout.\n- Do not comment on your own writing.\n- Do not add any notes or references. Do not make up additional information.\n- Do not discuss the importance or impact of the gene set. Focus only on its function.\n[End of Prompt]\n\n[Start of Input]\n- The primary molecular and cellular function of gene LETMD1 is to play an essential role in maintaining mitochondrial structure and function, as well as regulating thermogenesis in brown adipocytes, and may also be involved in regulating phagocytosis and inflammatory responses in macrophages. Additionally, LETMD1 localizes in the nucleus where it interacts with chromatin remodeler SMARCA4 to regulate thermogenic genes expression.\n- The primary molecular and cellular function of gene CIRBP is to act as a cold-inducible RNA-binding protein that plays a protective role in the genotoxic stress response by stabilizing transcripts of genes involved in cell survival, and also functions as a translational activator and repressor. Additionally, CIRBP promotes the assembly of stress granules and is involved in the negative regulation of translation.\n- The primary molecular and cellular function of gene CCNB1IP1 is to encode a protein that interacts with cyclin B1, facilitating protein-protein binding and potentially regulating cell cycle progression. This interaction enables the formation of protein complexes that play a crucial role in cellular processes.\n- The primary molecular and cellular function of gene TAF1D is to act as a component of the transcription factor SL1/TIF-IB complex, which is involved in the assembly of the preinitiation complex during RNA polymerase I-dependent transcription, and to stabilize nucleolar transcription factor 1/UBTF on rDNA. This complex formation enables the recruitment of RNA polymerase I to the rDNA promoter, facilitating transcription initiation.\n- The primary molecular and cellular function of gene ZFAS1 is to act as a long non-coding RNA that regulates the expression of its sense counterpart, ZNFX1, by forming a double-stranded RNA structure, thereby influencing ZNFX1's role in transcriptional regulation and RNA processing. Additionally, ZFAS1 has been implicated in the regulation of cellular stress responses and apoptosis.\n- The primary molecular and cellular function of gene SELENOW is to encode selenoprotein W, which acts as a glutathione-dependent antioxidant, playing a role in cellular oxidant detoxification and potentially involved in redox-related processes. This protein interacts with various molecules, including DPYSL2, PRDX1, YWHAB, YWHAG, HSP70, and HSP90, to carry out its antioxidant functions.\n- The primary molecular and cellular function of gene SNHG12 is to host and regulate the expression of small nucleolar RNAs (snoRNAs), which are involved in the modification and processing of other RNA molecules. Specifically, SNHG12 is thought to play a role in the maturation of ribosomal RNAs and other non-coding RNAs.\n- The primary molecular and cellular function of gene SNHG32 is to host and regulate the expression of small nucleolar RNAs (snoRNAs), which are involved in the modification and processing of other RNA molecules. Specifically, SNHG32 is thought to play a role in the maturation of ribosomal RNAs and other non-coding RNAs.\n- The primary molecular and cellular function of gene EPB41L4A-AS1 is to regulate the expression of its sense counterpart, EPB41L4A, by forming a double-stranded RNA structure that triggers RNA degradation or transcriptional interference, thereby modulating the activity of the EPB41L4A protein, which is involved in cytoskeleton organization and cell adhesion. This antisense RNA may also influence the expression of other genes in the vicinity through chromatin remodeling or transcriptional interference.\n- The primary molecular and cellular function of gene GAS5 is to regulate cell growth and proliferation by modulating the activity of various signaling pathways, including the mTOR and PI3K/AKT pathways, and to induce apoptosis in response to cellular stress. GAS5 also plays a role in regulating ribosome biogenesis and RNA processing.\n- The primary molecular and cellular function of gene SNHG6 is to host and regulate the expression of small nucleolar RNAs (snoRNAs), which are involved in the modification and processing of other RNA molecules. Specifically, SNHG6 is thought to play a role in the maturation of ribosomal RNAs and other non-coding RNAs.\n- The primary molecular and cellular function of gene SNHG8 is to host and regulate the expression of small nucleolar RNAs (snoRNAs), which are involved in the modification and processing of other RNA molecules. Specifically, SNHG8 is thought to play a role in the maturation of ribosomal RNAs and other non-coding RNAs.\n[End of Input]\n\n[Start of Output]\n1) Brief overview of gene set:\n2) Upstream pathways may affect this gene set:\n3) Name of gene set:\n[End of Output]\n"]